qiurenguo2014/youjiesun_dg/code1/maincode/userINC/LM3S5B91_GPIO.H
#ifndef _LM3S5B91_GPIO_H
#define _LM3S5B91_GPIO_H

#define PIN_PA0 GPIO_PIN_0
#define PIN_PA1 GPIO_PIN_1
#define PIN_PA2 GPIO_PIN_2
#define PIN_PA3 GPIO_PIN_3
#define PIN_PA4 GPIO_PIN_4
#define PIN_PA5 GPIO_PIN_5
#define PIN_PA6 GPIO_PIN_6
#define PIN_PA7 GPIO_PIN_7

#define PIN_PB0 GPIO_PIN_0
#define PIN_PB1 GPIO_PIN_1
#define PIN_PB2 GPIO_PIN_2
#define PIN_PB3 GPIO_PIN_3
#define PIN_PB4 GPIO_PIN_4
#define PIN_PB5 GPIO_PIN_5
#define PIN_PB6 GPIO_PIN_6
#define PIN_PB7 GPIO_PIN_7

#define PIN_PC0 GPIO_PIN_0
#define PIN_PC1 GPIO_PIN_1
#define PIN_PC2 GPIO_PIN_2
#define PIN_PC3 GPIO_PIN_3
#define PIN_PC4 GPIO_PIN_4
#define PIN_PC5 GPIO_PIN_5
#define PIN_PC6 GPIO_PIN_6
#define PIN_PC7 GPIO_PIN_7

#define PIN_PD0 GPIO_PIN_0
#define PIN_PD1 GPIO_PIN_1
#define PIN_PD2 GPIO_PIN_2
#define PIN_PD3 GPIO_PIN_3
#define PIN_PD4 GPIO_PIN_4
#define PIN_PD5 GPIO_PIN_5
#define PIN_PD6 GPIO_PIN_6
#define PIN_PD7 GPIO_PIN_7

#define PIN_PE0 GPIO_PIN_0
#define PIN_PE1 GPIO_PIN_1
#define PIN_PE2 GPIO_PIN_2
#define PIN_PE3 GPIO_PIN_3
#define PIN_PE4 GPIO_PIN_4
#define PIN_PE5 GPIO_PIN_5
#define PIN_PE6 GPIO_PIN_6
#define PIN_PE7 GPIO_PIN_7
 
#define PIN_PF0 GPIO_PIN_0
#define PIN_PF1 GPIO_PIN_1
#define PIN_PF2 GPIO_PIN_2
#define PIN_PF3 GPIO_PIN_3
#define PIN_PF4 GPIO_PIN_4
#define PIN_PF5 GPIO_PIN_5
#define PIN_PF6 GPIO_PIN_6
#define PIN_PF7 GPIO_PIN_7
 
#define PIN_PG0 GPIO_PIN_0
#define PIN_PG1 GPIO_PIN_1
#define PIN_PG2 GPIO_PIN_2
#define PIN_PG3 GPIO_PIN_3
#define PIN_PG4 GPIO_PIN_4
#define PIN_PG5 GPIO_PIN_5
#define PIN_PG6 GPIO_PIN_6
#define PIN_PG7 GPIO_PIN_7

#define PIN_PH0 GPIO_PIN_0
#define PIN_PH1 GPIO_PIN_1
#define PIN_PH2 GPIO_PIN_2
#define PIN_PH3 GPIO_PIN_3
#define PIN_PH4 GPIO_PIN_4
#define PIN_PH5 GPIO_PIN_5
#define PIN_PH6 GPIO_PIN_6
#define PIN_PH7 GPIO_PIN_7


#define PIN_PJ0 GPIO_PIN_0
#define PIN_PJ1 GPIO_PIN_1
#define PIN_PJ2 GPIO_PIN_2
#define PIN_PJ3 GPIO_PIN_3
#define PIN_PJ4 GPIO_PIN_4
#define PIN_PJ5 GPIO_PIN_5
#define PIN_PJ6 GPIO_PIN_6
#define PIN_PJ7 GPIO_PIN_7

  
#endif


